Repository: BenMcLean/vengi
Catalog: data/shared/*.po
Languages: uk

source: The language to use - empty means system default
uk: Мова для використання - порожньо означає системний стандарт

source: Log to the system log
uk: Записувати до системного журналу

source: The lower the value, the more you see. 1 is the highest log level, 5 is just fatal errors.
uk: Чим нижче значення, тим більше ви бачите. 1 - найвищий рівень журналу, 5 - тільки фатальні помилки.

source: Print the version and quit
uk: Друкувати версію та вийти

source: Print this help and quit
uk: Друкувати цю довідку та вийти

source: Generate completion for bash
uk: Генерувати завершення для bash

source: Change log level from 1 (trace) to 6 (only critical)
uk: Змінити рівень журналу з 1 (слідування) до 6 (лише критичні)

source: Set a variable value
uk: Встановити значення змінної

source: Quit the application
uk: Вийти з програми

source: Trigger an assert
uk: Запустити assert

source: Clear the value history of a variable
uk: Очистити історію значень змінної

source: Just a no-operation command
uk: Просто команда без операцій

source: Open the given url in a browser
uk: Відкрити вказану URL-адресу в браузері

source: Print the given arguments to the console (info log level)
uk: Друкувати вказані аргументи в консоль (рівень інформаційного журналу)

source: Execute a file with script commands
uk: Виконати файл із командами скрипта

source: Toggle between true/false for a variable
uk: Перемикання між true/false для змінної

source: Increase a cvar value by the given value (default: 1)
uk: Збільшити значення cvar на вказане значення (за замовчуванням: 1)

source: Decrease a cvar value by the given value (default: 1)
uk: Зменшити значення cvar на вказане значення (за замовчуванням: 1)

source: Show the value of a variable
uk: Показати значення змінної

source: Print current milliseconds to console
uk: Друкувати поточні мілісекунди в консоль

source: Log given message as error
uk: Записати вказане повідомлення як помилку

source: Log given message as info
uk: Записати вказане повідомлення як інформацію

source: Log given message as debug
uk: Записати вказане повідомлення як відлагодження

source: Log given message as warn
uk: Записати вказане повідомлення як попередження

source: Show the list of known variables (wildcards supported)
uk: Показати список відомих змінних (підтримуються підстановочні символи)

source: Show the list of known commands (wildcards supported)
uk: Показати список відомих команд (підтримуються підстановочні символи)

source: Camera free look on toggle
uk: Вільний огляд камери при перемиканні

source: Toggle relative mouse rotation mode
uk: Перемикання режиму відносного обертання миші

source: Show all commands
uk: Показати всі команди

source: Show all cvars
uk: Показати всі cvars

source: Cloud
uk: Хмара

source: Desktop
uk: Робочий стіл

source: Documents
uk: Документи

source: Download
uk: Завантажити

source: Pictures
uk: Зображення

source: Public
uk: Загальний доступ

source: Recent
uk: Нещодавні

source: Quick Access
uk: Швидкий доступ

source: This PC
uk: Цей ПК

source: Bookmarks
uk: Закладки

source: Remove bookmark
uk: Видалити закладку

source: File
uk: Файл

source: Size
uk: Розмір

source: Type
uk: Тип

source: Date
uk: Дата

source: directory
uk: каталог

source: Add a bookmark for the current active folder
uk: Додати закладку для поточної активної папки

source: Show hidden file system entities
uk: Показати приховані об'єкти файлової системи

source: The last selected file type filter in the file dialog
uk: Останній вибраний фільтр типу файлу в діалоговому вікні файлів

source: Create folder
uk: Створити папку

source: Enter a name for the new folder
uk: Введіть ім'я для нової папки

source: Create
uk: Створити

source: Folder name can't be empty
uk: Ім'я папки не може бути порожнім

source: Cancel
uk: Скасувати

source: File already exists
uk: Файл вже існує

source: %s already exist. Do you want to overwrite the file?
uk: %s вже існує. Бажаєте перезаписати файл?

source: Yes
uk: Так

source: No
uk: Ні

source: Filter
uk: Фільтр

source: Save file
uk: Зберегти файл

source: Select a directory
uk: Вибрати каталог

source: Select a file
uk: Вибрати файл

source: New folder
uk: Нова папка

source: Filename
uk: Ім'я файлу

source: Show hidden
uk: Показати приховані

source: Options
uk: Параметри

source: Choose
uk: Вибрати

source: Open
uk: Відкрити

source: Save
uk: Зберегти

source: Error: You must select a folder!
uk: Помилка: Ви повинні вибрати папку!

source: Error: You must select a file!
uk: Помилка: Ви повинні вибрати файл!

source: Change the ui colors - [0-3]
uk: Змінити кольори інтерфейсу - [0-3]

source: Timeout for notifications in millis
uk: Тайм-аут для сповіщень у мілісекундах

source: Allow multi monitor setups - requires a restart
uk: Дозволити налаштування з кількома моніторами - потребує перезапуску

source: Render the ui
uk: Відображати інтерфейс користувача

source: Show metric and debug window
uk: Показати вікно метрики та відлагодження

source: Allow to change the ui font size
uk: Дозволити змінювати розмір шрифту інтерфейсу користувача

source: Which keybinding to use
uk: Яку прив'язку клавіш використовувати

source: Bindings
uk: Прив'язки

source: Keys
uk: Клавіші

source: Command
uk: Команда

source: Context
uk: Контекст

source: Description
uk: Опис

source: Failed to get command for %s
uk: Не вдалося отримати команду для %s

source: Keymap
uk: Клавіатурна розкладка

source: Reset to default
uk: Скинути до стандартних налаштувань

source: Configuration variables
uk: Конфігураційні змінні

source: Name
uk: Ім'я

source: Value
uk: Значення

source: Reset
uk: Скинути

source: Reset to default value
uk: Скинути до стандартного значення

source: Close
uk: Закрити

source: Commands
uk: Команди

source: Textures
uk: Текстури

source: Language
uk: Мова

source: To change the language everywhere restart the application
uk: Щоб змінити мову всюди, перезапустіть програму

source: Clear
uk: Очистити

source: Copy to clipboard
uk: Скопіювати в буфер обміну

source: Debug
uk: Відлагодження

source: Enable debug logging for the console
uk: Увімкнути ведення журналу відлагодження для консолі

source: Auto scrolling
uk: Автоматична прокрутка

source: Open in browser %s
uk: Відкрити в браузері %s

source: Enable sending anonymous metrics
uk: Увімкнути надсилання анонімних метрик

source: Send anonymous usage statistics
uk: Надсилати анонімну статистику використання

source: This is a beta release!
uk: Це бета-версія!

source: A new version is available!
uk: Доступна нова версія!

source: You are using the latest version.
uk: Ви використовуєте останню версію.

source: Bug reports
uk: Звіти про помилки

source: Help
uk: Довідка

source: Credits
uk: Автори

source: Paths
uk: Шляхи

source: Clear the text from the built-in console
uk: Очистити текст з вбудованої консолі

source: Print the command history
uk: Вивести історію команд

source: Show all known key bindings
uk: Показати всі відомі прив'язки клавіш

source: Bind a command to a key
uk: Прив'язати команду до клавіші

source: Unbind a key
uk: Відв'язати клавішу

source: Show all images in the texture pool
uk: Показати всі зображення в текстурному пулі

source: Activate shadow map
uk: Активувати тіньову карту

source: Activate bloom post processing
uk: Активувати пост-процес блиску

source: Activate shadow debug rendering
uk: Активувати відлагодження тіней

source: Activate cascade shadow map debug rendering
uk: Активувати відлагодження каскадних тіней

source: Gamma correction
uk: Гамма-корекція

source: Render voxel outline
uk: Відображати контур вокселя

source: Activate tone mapping
uk: Активувати тонове відображення

source: Limit the framerate to the monitor refresh rate
uk: Обмежити частоту кадрів частотою оновлення монітора

source: 0 disables it, 1 only highest severity, 2 medium severity, 3 everything
uk: 0 вимикає його, 1 тільки найвищий рівень серйозності, 2 середній рівень серйозності, 3 все

source: Minimize the window
uk: Згорнути вікно

source: Back
uk: Назад

source: Bottom
uk: Вниз

source: Free
uk: Вільний

source: Front
uk: Вперед

source: Left
uk: Ліворуч

source: Right
uk: Праворуч

source: Top
uk: Вгору

source: Overwrite existing target file
uk: Перезаписати існуючий файл-ціль

source: Uniform scale
uk: Рівномірне масштабування

source: X axis scale
uk: Масштаб по осі X

source: Y axis scale
uk: Масштаб по осі Y

source: Z axis scale
uk: Масштаб по осі Z

source: Merge quads
uk: Об'єднати квадрати

source: Reuse vertices
uk: Використовувати вершини повторно

source: Ambient occlusion
uk: Приглушення освітлення

source: Apply transformations
uk: Застосувати перетворення

source: Apply optimizations
uk: Застосувати оптимізації

source: Exports quads
uk: Експортувати квадрати

source: Vertex colors
uk: Кольори вершин

source: Normals
uk: Нормалі

source: Vertex colors as float
uk: Кольори вершин як дійсні числа

source: Texture coordinates
uk: Координати текстури

source: Export materials
uk: Експортувати матеріали

source: Single object
uk: Один об'єкт

source: Save visible only
uk: Зберегти тільки видиме

source: Palette mode
uk: Режим палітри

source: Merge compounds
uk: Об'єднати сполуки

source: Create groups
uk: Створити групи

source: Create layers
uk: Створити шари

source: Left handed
uk: Ліворучна

source: Compressed
uk: Стиснута

source: Red Alert
uk: Червона тривога

source: Tiberian Sun
uk: Тіберіан Сан

source: Normal type
uk: Звичайний тип

source: Fill hollow
uk: Заповнити порожнину

source: Point cloud size
uk: Розмір хмари точок

source: faster and less memory
uk: швидше і менше пам'яті

source: high quality
uk: висока якість

source: Voxelization mode
uk: Режим вокселізації

source: RGB flatten factor
uk: Коефіцієнт згладжування RGB

source: RGB weighted average
uk: Зважений середній RGB

source: Create palette
uk: Створити палітру

source: Quit
uk: Вийти

source: Edit
uk: Редагувати

source: Allow multi monitor
uk: Дозволити кілька моніторів

source: Font size
uk: Розмір шрифту

source: Dark
uk: Темний

source: Classic
uk: Класичний

source: Light
uk: Світлий

source: Color theme
uk: Кольорова тема

source: Notifications
uk: Сповіщення

source: About
uk: Про програму

source: Source
uk: Джерело

source: Source format
uk: Формат джерела

source: Target format
uk: Формат цілі

source: Source options
uk: Параметри джерела

source: Target options
uk: Параметри цілі

source: Convert
uk: Конвертувати

source: Found vengi-voxconvert at %s
uk: Знайдено vengi-voxconvert за адресою %s

source: Open target file
uk: Відкрити файл-ціль

source: Use the color wheel in the palette color editing
uk: Використовувати колірне колесо при редагуванні кольору палітри

source: Always show the color picker below the palette
uk: Завжди показувати вибір кольору під палітрою

source: Milliseconds that a region should get highlighted in a few situations
uk: Мілісекунди, протягом яких регіон повинен виділятися в деяких ситуаціях

source: Show fixed region sizes in the positions panel
uk: Показувати фіксовані розміри регіонів у панелі позицій

source: Show the grid
uk: Показувати сітку

source: Show the currently locked axis
uk: Показувати поточну заблоковану вісь

source: Show the axis aligned bounding box
uk: Показувати орієнтовану прямокутну оболонку

source: Show the bones in scene mode
uk: Показувати кістки в режимі сцени

source: Render with shadows - make sure to set the scene lighting up properly
uk: Відображати з тінями - переконайтеся, що освітлення сцени налаштовано належним чином

source: Millisecond delay between frames hide/unhide when using the scene graph panel play button to animate the models in the scene
uk: Затримка в мілісекундах між кадрами при приховуванні/показуванні, коли використовується кнопка відтворення панелі графа сцени для анімації моделей у сцені

source: The size of the voxel grid
uk: Розмір сітки вокселів

source: Render the inactive nodes in gray scale mode
uk: Відображати неактивні вузли у режимі сірої шкали

source: Hide the inactive nodes
uk: Приховати неактивні вузли

source: Show the axis
uk: Показувати вісь

source: Print cursor details in edit mode
uk: Виводити деталі курсора в режимі редагування

source: Set auto keyframe
uk: Встановити автоматичний ключовий кадр

source: Bitmask of gizmo operations in scene mode
uk: Бітова маска операцій гізмо в режимі сцени

source: Activate the pivot mode for the gizmo in scene mode
uk: Активувати режим повороту для гізмо в режимі сцени

source: Flip axis or stay along the positive world/local axis
uk: Перевернути вісь або залишитися вздовж позитивної світової/локальної вісі

source: Use the grid size for snap
uk: Використовувати розмір сітки для прив'язки

source: Show the gizmo to also translate the region
uk: Показувати гізмо для також переміщення регіону

source: The amount of viewports (not in simple ui mode)
uk: Кількість вікон перегляду (не в режимі простого інтерфейсу)

source: Hide some panels to simplify the ui
uk: Приховати деякі панелі, щоб спростити інтерфейс

source: Show the tip of the day on startup
uk: Показувати пораду дня при запуску

source: Trigger opening of popup
uk: Виклик відкриття спливаючого вікна

source: Save the current viewport as screenshot
uk: Зберегти поточний вигляд як знімок екрана

source: Toggle scene mode on/off
uk: Увімкнути/вимкнути режим сцени

source: Save the current scene to the given file
uk: Зберегти поточну сцену у вказаний файл

source: Save the selection from the current active model node
uk: Зберегти вибір з поточного активного вузла моделі

source: Load a scene from the given volume file
uk: Завантажити сцену з вказаного файлу об'єму

source: Add a volume to the existing scene from the given file
uk: Додати об'єм до існуючої сцени з вказаного файлу

source: Import all files from a given directory
uk: Імпортувати всі файли з вказаного каталогу

source: Import a 2d heightmap image into the current active node
uk: Імпортувати 2D зображення карти висот у поточний активний вузол

source: Import a 2d heightmap image into the current active node. The height is encoded in the alpha channel with this method.
uk: Імпортувати 2D зображення карти висот у поточний активний вузол. Висота кодується в альфа-каналі за допомогою цього методу.

source: Import an image as a plane into a new node
uk: Імпортувати зображення як площину в новий вузол

source: Import an image as a volume into a new node
uk: Імпортувати зображення як об'єм в новий вузол

source: Import an image as a palette
uk: Імпортувати зображення як палітру

source: Create a new scene with ui interaction
uk: Створити нову сцену з взаємодією з інтерфейсом

source: Reset cameras in viewports
uk: Скинути камери вікон перегляду

source: Animation
uk: Анімація

source: Add
uk: Додати

source: Delete
uk: Видалити

source: Add a new keyframe to the current active node
uk: Додати новий ключовий кадр до поточного активного вузла

source: Add all
uk: Додати всі

source: Add a new keyframe to all model nodes
uk: Додати новий ключовий кадр до всіх вузлів моделі

source: Delete the current keyframe of the active nodes
uk: Видалити поточний ключовий кадр активних вузлів

source: Crop frames
uk: Обрізати кадри

source: Max frames for this animation: %i
uk: Максимальна кількість кадрів для цієї анімації: %i

source: Keyframe %i, Interpolation: %s
uk: Ключовий кадр %i, Інтерполяція: %s

source: Copy
uk: Копіювати

source: Paste
uk: Вставити

source: Duplicate keyframe
uk: Дублювати ключовий кадр

source: Delete keyframes
uk: Видалити ключові кадри

source: Delete %i keyframes
uk: Видалити %i ключові кадри

source: Assets
uk: Активи

source: Models
uk: Моделі

source: Images
uk: Зображення

source: Shape
uk: Форма

source: Disable mirror
uk: Вимкнути дзеркало

source: Use selection
uk: Використовувати вибір

source: Model
uk: Модель

source: Select a model from the asset panel or scene graph panel
uk: Виберіть модель з панелі активів або панелі графіку сцени

source: Center
uk: Центр

source: Continuous
uk: Постійний

source: Replace
uk: Замінити

source: Replace all voxels in the stamp with the selected color
uk: Замінити всі вокселі в штампі вибраним кольором

source: Rotate on axis
uk: Повернути на вісь

source: Rotate by 90 degree on the x axis
uk: Повернути на 90 градусів по осі x

source: Rotate by 90 degree on the y axis
uk: Повернути на 90 градусів по осі y

source: Rotate by 90 degree on the z axis
uk: Повернути на 90 градусів по осі z

source: Reduce size
uk: Зменшити розмір

source: Extrude voxels
uk: Витягнути вокселі

source: Erase voxels
uk: Видалити вокселі

source: Override voxels
uk: Перезаписати вокселі

source: Draws a line from the reference position to the current cursor position
uk: Малює лінію від початкового положення до поточного положення курсора

source: 18-connected
uk: 18-з'єднаний

source: 26-connected
uk: 26-з'єднаний

source: 6-connected
uk: 6-з'єднаний

source: Connectivity
uk: З'єднаність

source: Draws a path over existing voxels
uk: Малює шлях над існуючими вокселями

source: Convert palette
uk: Конвертувати палітру

source: Default
uk: За замовчуванням

source: Single
uk: Одиночний

source: Radius
uk: Радіус

source: Use a radius around the current voxel - 0 for spanning a region
uk: Використовуйте радіус навколо поточного вокселя - 0 для охоплення регіону

source: Clamping
uk: Затиснення

source: Clamp the brush to the volume
uk: Затиснути пензлик до об'єму

source: Text
uk: Текст

source: Horizontal spacing
uk: Горизонтальний інтервал

source: Thickness
uk: Товщина

source: Print text along the x axis
uk: Друкувати текст вздовж осі x

source: Print text along the y axis
uk: Друкувати текст вздовж осі y

source: Print text along the z axis
uk: Друкувати текст вздовж осі z

source: Font
uk: Шрифт

source: Mode
uk: Режим

source: Factor
uk: Фактор

source: Variation threshold
uk: Поріг варіацій

source: Plane
uk: Площина

source: Paint the selected plane
uk: Намалювати вибрану площину

source: Gradient
uk: Градієнт

source: Brush settings
uk: Налаштування пензлика

source: Click on a voxel to pick the color
uk: Клацніть по вокселю, щоб вибрати колір

source: Select areas of voxels
uk: Вибрати області вокселів

source: Brush
uk: Пензлик

source: Camera
uk: Камера

source: Position
uk: Положення

source: Farplane
uk: Дальній план

source: Nearplane
uk: Ближній план

source: Target
uk: Ціль

source: Target distance
uk: Відстань до цілі

source: Aspect
uk: Співвідношення сторін

source: Add new camera
uk: Додати нову камеру

source: License
uk: Ліцензія

source: Format
uk: Формат

source: Thumbnail
uk: Мініатюра

source: Loading...
uk: Завантаження...

source: Load
uk: Завантажити

source: Use stamp
uk: Використовувати штамп

source: This is only possible if the model doesn't exceed the max allowed stamp size
uk: Це можливо лише якщо модель не перевищує максимальний дозволений розмір штампа

source: Add to scene
uk: Додати до сцени

source: Hide thumbnails
uk: Приховати мініатюри

source: Show thumbnails
uk: Показати мініатюри

source: Open target dir
uk: Відкрити цільовий каталог

source: Empty palette index
uk: Порожній індекс палітри

source: L-System
uk: L-система

source: Axiom
uk: Аксіома

source: Rules
uk: Правила

source: Angle
uk: Кут

source: Length
uk: Довжина

source: Width
uk: Ширина

source: Width increment
uk: Приріст ширини

source: Iterations
uk: Ітерації

source: Leaves radius
uk: Радіус листя

source: Draw line forwards
uk: Малювати лінію вперед

source: Set voxel type
uk: Встановити тип вокселя

source: Move backwards (no drawing)
uk: Рухатися назад (без малювання)

source: Leaf
uk: Листок

source: Rotate right
uk: Повернути вправо

source: Rotate left
uk: Повернути вліво

source: Rotate forward
uk: Повернути вперед

source: Rotate back
uk: Повернути назад

source: Increment width
uk: Збільшити ширину

source: Decrement width
uk: Зменшити ширину

source: Push
uk: Товкти

source: Pop
uk: Витягти

source: Switch between scene and edit mode (not in simple UI mode) by pressing the <cmd:togglescene> key.
uk: Переключайтеся між режимами сцени та редагування (не в простому режимі користувача) натисканням клавіші <cmd:togglescene>.

source: Use the file dialog options for format specific options.
uk: Використовуйте параметри діалогового вікна файлів для специфічних параметрів формату.

source: You can record a video of your rotating model in the viewport by using the 'View' menu and the 'Video' option. Make sure to set the camera rotation speed to e.g. 1.
uk: Ви можете записати відео обертання вашої моделі в області перегляду, використовуючи меню 'Вид' та опцію 'Відео'. Переконайтеся, що швидкість обертання камери встановлена, наприклад, 1.

source: When saving to a foreign format you might lose scene details if the format doesn't support particular features. Make sure to use the vengi format for highest compatibility.
uk: При збереженні у зовнішній формат ви можете втратити деталі сцени, якщо формат не підтримує певні функції. Переконайтеся, що використовуєте формат vengi для найвищої сумісності.

source: Change the color reduction mode to improve the quality of the palette especially for importing RGBA or mesh based formats.
uk: Змініть режим зменшення кольору, щоб покращити якість палітри, особливо при імпорті форматів на основі RGBA або мешів.

source: Drag a model from the assets panel to the stamp brush to use it.
uk: Перетягніть модель з панелі активів на пензлик штампу, щоб використовувати її.

source: You can reset the camera simply by pressing <cmd:resetcamera>.
uk: Ви можете скинути камеру, просто натиснувши <cmd:resetcamera>.

source: The editor shows the last executed console command in the status bar. You can use these commands and bind them to keys.
uk: Редактор показує останню виконану команду консолі на панелі стану. Ви можете використовувати ці команди та прив'язувати їх до клавіш.

source: You can use wasd style scene movement by switching the 'Camera movement' to 'Eye' in the 'View' menu of the viewport.
uk: Ви можете використовувати рух сцени у стилі wasd, перемикаючи 'Рух камери' на 'Око' в меню 'Вид' області перегляду.

source: In order to use the path modifier, you have to place the reference position on top of another voxel and place the end of the path on another existing and connected voxel.
uk: Для використання модифікатора шляху потрібно розмістити початкове положення на верхньому вокселі та розмістити кінець шляху на іншому існуючому та підключеному вокселі.

source: When importing meshes, you can switch between different voxelization methods in the options menu.
uk: При імпорті мешів ви можете перемикатися між різними методами вокселізації в меню параметрів.

source: Delete voxels in edit mode by pressing <cmd:+actionexecutedelete> or by using the erase modifier.
uk: Видаліть вокселі в режимі редагування, натиснувши <cmd:+actionexecutedelete> або використовуючи модифікатор видалення.

source: Switch between different color themes in the options menu.
uk: Переключайтеся між різними кольоровими темами в меню параметрів.

source: Please activate anonymous usage metrics in the options or the about dialog.
uk: Будь ласка, активуйте анонімну метрику використання в параметрах або в діалоговому вікні 'Про програму'.

source: You can change your default key bindings to Magicavoxel, Blender, Qubicle or Vengi own style. Check the bindings window in the options menu.
uk: Ви можете змінити ваші типові прив'язки клавіш на стиль Magicavoxel, Blender, Qubicle або Vengi. Перевірте вікно прив'язок в меню параметрів.

source: You can save your viewport as AVI video or as screenshot.
uk: Ви можете зберегти вашу область перегляду як відео AVI або як знімок екрану.

source: Press <cmd:pickcolor> to pick a color from the scene.
uk: Натисніть <cmd:pickcolor>, щоб вибрати колір з сцени.
