Repository: BenMcLean/vengi
Catalog: data/shared/*.po
Languages: uk

source: Press <cmd:mirroraxisshapebrushx>, <cmd:mirroraxisshapebrushy> or <cmd:mirroraxisshapebrushz> to mirror the current selection.
uk: Натисніть <cmd:mirroraxisshapebrushx>, <cmd:mirroraxisshapebrushy> або <cmd:mirroraxisshapebrushz>, щоб відобразити поточний вибір.

source: Tip of the day
uk: Порада дня

source: Show again
uk: Показати знову

source: Next
uk: Далі

source: Welcome
uk: Ласкаво просимо

source: Welcome to VoxEdit!
uk: Ласкаво просимо до VoxEdit!

source: The mission: Create a free, open-source and multi-platform voxel editor with animation support for artists and developers.
uk: Місія: Створити безкоштовний, відкритий та багатоплатформний редактор вокселів з підтримкою анімації для художників та розробників.

source: We would like to enable anonymous usage metrics to improve the editor. Please consider enabling it.
uk: Ми хотіли б активувати анонімну метрику використання для покращення редактора. Будь ласка, розгляньте можливість його активації.

source: Simple mode
uk: Простий режим

source: Unreference Model
uk: Відсилання на модель

source: You can't edit a model reference. Do you want to convert the reference into a model?
uk: Ви не можете редагувати посилання на модель. Ви хочете перетворити посилання на модель?

source: New Scene
uk: Нова сцена

source: Templates
uk: Шаблони

source: Empty scene
uk: Порожня сцена

source: Height
uk: Висота

source: Depth
uk: Глибина

source: Failed to save
uk: Не вдалося зберегти

source: Failed to save the model!
uk: Не вдалося зберегти модель!

source: Unsaved Changes
uk: Незбережені зміни

source: Unsaved changes - are you sure to quit?
uk: Незбережені зміни - ви впевнені, що хочете вийти?

source: Unsaved Modifications
uk: Незбережені зміни

source: There are unsaved modifications. Do you wish to discard them?
uk: Є незбережені зміни.

source: Some model volumes are too big for optimal performance. It's encouraged to split them into smaller volumes. Do you wish to split them now?
uk: Деякі об'єми моделей занадто великі для оптимальної продуктивності. Рекомендується розбити їх на менші об'єми. Ви хочете розбити їх зараз?

source: Model settings
uk: Налаштування моделі

source: Rename node
uk: Перейменувати вузол

source: Node names should be unique
uk: Назви вузлів повинні бути унікальними

source: Apply
uk: Застосувати

source: Formats
uk: Формати

source: Voxel load
uk: Завантаження вокселів

source: Extension
uk: Розширення

source: Voxel save
uk: Збереження вокселів

source: Palettes
uk: Палітри

source: History
uk: Історія

source: Current state: %i / %i
uk: Поточний стан: %i / %i

source: Color reduction
uk: Зменшення кольору

source: The color reduction algorithm that is used when importing RGBA colors from images or rgba formats
uk: Алгоритм зменшення кольору, який використовується при імпорті кольорів RGBA з зображень або форматів rgba

source: Grid
uk: Сітка

source: Show gizmo
uk: Показати гізмо

source: Show locked axis
uk: Показати заблоковану вісь

source: Bounding box
uk: Межова рамка

source: Bones
uk: Кістки

source: Outlines
uk: Контур

source: Shadow
uk: Тінь

source: Bloom
uk: Світіння

source: Tone mapping
uk: Тонове відображення

source: New
uk: Новий

source: Recently opened
uk: Нещодавно відкриті

source: Save as
uk: Зберегти як

source: Save selection
uk: Зберегти вибір

source: Add file to scene
uk: Додати файл до сцени

source: Add directory to scene
uk: Додати каталог до сцени

source: Heightmap
uk: Карта висот

source: Colored heightmap
uk: Кольорова карта висот

source: Image as plane
uk: Зображення як площина

source: Image as volume
uk: Зображення як об'єм

source: Undo
uk: Скасувати

source: Redo
uk: Повторити

source: Cut
uk: Вирізати

source: Paste at reference
uk: Вставити за посиланням

source: Paste at cursor
uk: Вставити за курсором

source: Paste as new node
uk: Вставити як новий вузол

source: Paste as stamp
uk: Вставити як штамп

source: Color picker
uk: Вибір кольору

source: Color wheel
uk: Колірне колесо

source: Simplified UI
uk: Спрощений інтерфейс

source: Cubes
uk: Кубики

source: Marching cubes
uk: Маршрутні кубики

source: Mesh mode
uk: Режим мережі

source: Model animation speed
uk: Швидкість анімації моделі

source: Autosave delay in seconds
uk: Затримка автозбереження в секундах

source: Viewports
uk: Вікна перегляду

source: Zoom speed
uk: Швидкість масштабування

source: View distance
uk: Відстань перегляду

source: Reset layout
uk: Скинути розташування

source: Select
uk: Вибрати

source: None
uk: Немає

source: Invert
uk: Інвертувати

source: All
uk: Всі

source: Welcome screen
uk: Екран вітання

source: Region
uk: Регіон

source: pos
uk: поз

source: To transform
uk: До перетворення

source: Convert the region offset into the keyframe transforms
uk: Перетворити зміщення регіону в перетворення ключових кадрів

source: Interpolation
uk: Інтерполяція

source: Interpolation details
uk: Деталі інтерполяції

source: Reset all
uk: Скинути все

source: Auto Keyframe
uk: Автоматичний ключовий кадр

source: Automatically create keyframes when changing transforms
uk: Автоматично створювати ключові кадри при зміні перетворень

source: Mirror X
uk: Відобразити по X

source: Mirror XZ
uk: Відобразити по XZ

source: Mirror XYZ
uk: Відобразити по XYZ

source: Transform
uk: Перетворення

source: Local transforms
uk: Локальні перетворення

source: Update children
uk: Оновити дітей

source: Properties
uk: Властивості

source: Delete this node property
uk: Видалити цю властивість вузла

source: Add a new node property
uk: Додати нову властивість вузла

source: Node Inspector
uk: Інспектор вузла

source: Volume Inspector
uk: Інспектор об'єму

source: Model from color
uk: Модель з кольору

source: Remove alpha
uk: Видалити альфа

source: Duplicate color
uk: Дублювати колір

source: Remove color
uk: Видалити колір

source: Release CTRL to change the voxel color
uk: Відпустіть CTRL, щоб змінити колір вокселя

source: Press CTRL to re-order
uk: Натисніть CTRL, щоб змінити порядок

source: Empty color slot
uk: Порожній слот кольору

source: Select Palette
uk: Вибрати палітру

source: Select the palette
uk: Виберіть палітру

source: To add your own palettes here, put a palette-name.png into one of the search directories or load it into any node to appear here.
uk: Щоб додати власні палітри сюди, помістіть palette-name.png в одну з пошукових директорій або завантажте її в будь-який вузол, щоб вона з'явилася тут.

source: Color match
uk: Відповідність кольору

source: Adopt the current voxels to the best fitting colors of the new palette.
uk: Адаптувати поточні вокселі до найкращих відповідних кольорів нової палітри.

source: Switch
uk: Перемкнути

source: Export
uk: Експорт

source: Export the palette
uk: Експортувати палітру

source: Sort
uk: Сортувати

source: Original
uk: Оригінал

source: Hue
uk: Відтінок

source: Saturation
uk: Насиченість

source: Brightness
uk: Яскравість

source: Tools
uk: Інструменти

source: Remove unused color
uk: Видалити не використовуваний колір

source: Remove and re-create palette
uk: Видалити та створити палітру знову

source: Color closest match
uk: Найближчий колір

source: Select a color to find the closest match in the current loaded palette
uk: Виберіть колір, щоб знайти найближчий колір у поточній завантаженій палітрі

source: Palette
uk: Палітра

source: Palette index: %i (scene voxel index %i)
uk: Індекс палітри: %i (індекс вокселя сцени %i)

source: Color
uk: Колір

source: Save image
uk: Зберегти зображення

source: Stop path tracer
uk: Зупинити трасування шляху

source: Sample %i / %i
uk: Зразок %i / %i

source: Start path tracer
uk: Запустити трасування шляху

source: Render
uk: Рендер

source: Render Settings
uk: Налаштування рендеру

source: Dimensions
uk: Розміри

source: Tracer
uk: Трасування

source: Samples
uk: Зразки

source: The number of per-pixel samples used while rendering and is the only parameter used to control the tradeoff between noise and speed.
uk: Кількість зразків на піксель, що використовуються під час рендерингу і є єдиним параметром, що використовується для контролю компромісу між шумом і швидкістю.

source: Bounces
uk: Відскоки

source: The maximum number of bounces and should be high for scenes with glass and volumes, but otherwise a low number would suffice.
uk: Максимальна кількість відскоків, яка повинна бути великою для сцен зі склом і об'ємами, але в інших випадках достатньо низького числа.

source: Clamp
uk: Обмежити

source: Remove high-energy fireflies
uk: Видалити яскраві вогнівки

source: Preview ratio
uk: Співвідношення попереднього перегляду

source: Batch
uk: Пакет

source: No caustics
uk: Без каустиків

source: Removes certain path that cause caustics
uk: Видаляє певні шляхи, які викликають каустичні ефекти

source: Hide environment
uk: Приховати оточення

source: Removes the environment map from the camera rays.
uk: Видаляє карту оточення з променів камери.

source: Apply a linear filter to the image pixels
uk: Застосувати лінійний фільтр до пікселів зображення

source: High Quality BVH
uk: Висока якість BVH

source: High quality bounding volume hierarchy
uk: Високоякісна ієрархія обмежувальних об'ємів

source: Denoise
uk: Зменшити шум

source: High quality
uk: Висока якість

source: Geometry preview
uk: Попередній перегляд геометрії

source: Rename
uk: Перейменувати

source: Show all
uk: Показати все

source: Hide all
uk: Приховати все

source: Hide others
uk: Приховати інші

source: Lock all
uk: Заблокувати все

source: Unlock all
uk: Розблокувати все

source: Duplicate
uk: Дублювати

source: Create reference
uk: Створити посилання

source: Merge
uk: Об'єднати

source: Use as stamp
uk: Використовувати як штамп

source: Merge all
uk: Об'єднати все

source: Merge visible
uk: Об'єднати видиме

source: Merge locked
uk: Об'єднати заблоковане

source: Center origin
uk: Центрувати початок

source: Center reference
uk: Центрувати посилання

source: Convert to model
uk: Перетворити на модель

source: Save all
uk: Зберегти все

source: Add new group
uk: Додати нову групу

source: Add new point
uk: Додати нову точку

source: Disabled because inactive nodes are hidden and the active node is always visible
uk: Вимкнено, оскільки неактивні вузли приховані, а активний вузол завжди видимий

source: Color##node-%i
uk: Колір##вузол-%i

source: Reference Node
uk: Посилання на вузол

source: Reference Target Node
uk: Цільовий вузол посилання

source: Delete this model
uk: Видалити цю модель

source: Scene
uk: Сцена

source: Add a new model node
uk: Додати новий вузол моделі

source: Add a new group
uk: Додати нову групу

source: Remove the active node with all its children
uk: Видалити активний вузол з усіма його дітьми

source: Cameras
uk: Камери

source: Groups
uk: Групи

source: References
uk: Посилання

source: Merge onto
uk: Об'єднати з

source: Merge %s onto %s
uk: Об'єднати %s з %s

source: Move below
uk: Перемістити нижче

source: LUA scripts for manipulating the voxel volumes
uk: LUA-скрипти для роботи з воксельними об'ємами

source: Run
uk: Виконати

source: Execute the selected script for the currently loaded voxel volumes
uk: Виконати вибраний скрипт для поточно завантажених воксельних об'ємів

source: Script parameters
uk: Параметри скрипту

source: Scripts
uk: Скрипти

source: Create a new lua script
uk: Створити новий lua-скрипт

source: Edit script
uk: Редагувати скрипт

source: Edit the selected lua script
uk: Редагувати вибраний lua-скрипт

source: Reload
uk: Перезавантажити

source: Scripting manual
uk: Посібник зі скриптування

source: Script Editor
uk: Редактор скриптів

source: Apply and execute
uk: Застосувати та виконати

source: Overwrite scripts/%s
uk: Перезаписати скрипти/%s

source: Select all
uk: Вибрати все

source: Grayscale
uk: Відтінки сірого

source: Only active
uk: Тільки активний

source: Grid size
uk: Розмір сітки

source: Command: -
uk: Команда: -

source: Command: %s
uk: Команда: %s

source: Command: %s (%s)
uk: Команда: %s (%s)

source: Action
uk: Дія

source: Flip on axis
uk: Перевернути по вісі

source: Translate
uk: Перемістити

source: Volumes
uk: Об'єми

source: Voxels
uk: Вокселі

source: Cursor
uk: Курсор

source: Cursor details
uk: Деталі курсора

source: Gizmo settings
uk: Налаштування гізмо

source: Rotate
uk: Повернути

source: Activate the rotate operation
uk: Активувати операцію повороту

source: Activate the translate operation
uk: Активувати операцію переміщення

source: Pivot
uk: Ось

source: Snap to grid
uk: Прив'язати до сітки

source: Flip axis
uk: Перевернути вісь

source: Pine
uk: Сосна

source: Dome
uk: Купол

source: Dome Hanging Leaves
uk: Купол з висячими листям

source: Cone
uk: Конус

source: Fir
uk: Ялина

source: Branches Ellipsis
uk: Еліпс гілок

source: Ellipsis
uk: Еліпс

source: Cube
uk: Куб

source: Cube Sides
uk: Боки куба

source: Palm
uk: Пальма

source: SpaceColonization
uk: Колонізація простору

source: Trees
uk: Дерева

source: Seed
uk: Початкове значення

source: Trunk strength
uk: Сила стовбура

source: Trunk height
uk: Висота стовбура

source: Leaves width
uk: Ширина листя

source: Leaves height
uk: Висота листя

source: Leaves depth
uk: Глибина листя

source: Branch length
uk: Довжина гілки

source: Branch height
uk: Висота гілки

source: Branch size
uk: Розмір гілки

source: Trunk width
uk: Ширина стовбура

source: Trunk depth
uk: Глибина стовбура

source: Branch reduction
uk: Зменшення гілки

source: Trunk reduction
uk: Зменшення стовбура

source: Leaves
uk: Листя

source: Bezier leaf
uk: Без'є листя

source: Bezier trunk
uk: Без'є стовбур

source: Leaves h-offset
uk: Горизонтальний зсув листя

source: Branches
uk: Гілки

source: Amount
uk: Кількість

source: Branch position factor
uk: Фактор позиції гілки

source: Branch strength
uk: Сила гілки

source: Branch downward offset
uk: Вертикальний зсув гілки

source: Start width
uk: Початкова ширина

source: Start depth
uk: Початкова глибина

source: Leaf height
uk: Висота листя

source: Step delta
uk: Крок дельта

source: Leaves min length
uk: Мінімальна довжина листя

source: Leaves max length
uk: Максимальна довжина листя

source: Leaves thickness
uk: Товщина листя

source: pos: %i:%i:%i size: %i:%i:%i absolute: %i:%i:%i
uk: позиція: %i:%i:%i розмір: %i:%i:%i абсолютна: %i:%i:%i

source: pos: %i:%i:%i size: %i:%i:%i absolute: %i:%i:%i relative: %i:%i:%i
uk: позиція: %i:%i:%i розмір: %i:%i:%i абсолютна: %i:%i:%i відносна: %i:%i:%i

source: Loading
uk: Завантаження

source: Orthogonal
uk: Ортогональна

source: Perspective
uk: Перспективна

source: View
uk: Вигляд

source: Reset camera
uk: Скинути камеру

source: Camera rotation
uk: Поворот камери

source: Screenshot
uk: Знімок екрану

source: Video
uk: Відео

source: Stop recording
uk: Зупинити запис

source: Pending frames: %u
uk: Очікування кадрів: %u

source: You can control the fps of the video with the cvar %s Pending frames: %u
uk: Ви можете контролювати fps відео за допомогою cvar %s Очікування кадрів: %u

source: Eye
uk: Око

source: Reference Point
uk: Точка посилання

source: Camera movement
uk: Рух камери

source: Lines
uk: Лінії

source: Points
uk: Точки

source: Solid
uk: Суцільний

source: Render mode
uk: Режим відображення

source: Scene Mode
uk: Режим сцени

source: EditMode
uk: Режим редагування

source: SceneMode
uk: Режим сцени

source: Create a reference node
uk: Створити вузол посилання

source: Resize the volume to the current selection
uk: Змінити розмір об'єму на поточний вибір

source: Executes a lua script
uk: Виконує lua-скрипт

source: Change intensity by scaling the rgb values of the palette
uk: Змінити інтенсивність шляхом масштабування значень RGB палітри

source: Remove unused colors from palette
uk: Видалити невикористані кольори з палітри

source: Switch active node to hovered from scene graph mode
uk: Переключити активний вузол на наведений в режимі графа сцени

source: Select all nothing or invert
uk: Вибрати все, нічого або інвертувати

source: Cycle through all scene objects
uk: Прокрутити всі об'єкти сцени

source: Allow to align all nodes on the floor next to each other without overlapping
uk: Дозволяє розташовувати всі вузли на підлозі поруч один з одним без перекриття

source: Save all model nodes into filenames represented by their node names
uk: Зберегти всі вузли моделі в файли, представлені їх назвами вузлів

source: Save a single node to the given path with their node names
uk: Зберегти окремий вузол за вказаним шляхом з їх назвами вузлів

source: Create a new scene (with a given name and width, height, depth - all optional)
uk: Створити нову сцену (з вказаним ім'ям та шириною, висотою, глибиною - все необов'язково)

source: Crop the current active node to the voxel boundaries
uk: Обрізати поточний активний вузол до границь вокселів

source: Split the current active node into multiple nodes
uk: Розділити поточний активний вузол на кілька вузлів

source: Scale the current active node or the given node down
uk: Зменшити масштаб поточного активного вузла або вказаного вузла

source: Scale the current active node or the given node up
uk: Збільшити масштаб поточного активного вузла або вказаного вузла

source: Move the voxels of the current selected palette index or the given index into a new node
uk: Перемістити вокселі поточного вибраного індексу палітри або вказаного індексу в новий вузол

source: Aborts the current modifier action
uk: Перериває поточну дію модифікатора

source: Fill the inner parts of closed models
uk: Заповнити внутрішні частини закритих моделей

source: Remove non visible voxels
uk: Видалити невидимі вокселі

source: Fill voxels in the current selection
uk: Заповнити вокселі в поточному виборі

source: Remove all voxels in the current selection
uk: Видалити всі вокселі в поточному виборі

source: Set the reference position to the specified position
uk: Встановити позицію посилання на вказану позицію

source: Move the cursor by the specified offsets
uk: Перемістити курсор за вказаними зсувами

source: Load a palette by name. E.g. 'built-in:nippon' or 'lospec:id'
uk: Завантажити палітру за назвою. Наприклад, 'built-in:nippon' або 'lospec:id'

source: Set the cursor to the specified position
uk: Встановити курсор на вказану позицію

source: Set the reference position to the current cursor position
uk: Встановити позицію посилання на поточну позицію курсора

source: Resize your volume about given x, y and z size
uk: Змінити розмір об'єму за вказаними розмірами x, y та z

source: Resize your current model node about given x, y and z size
uk: Змінити розмір поточного вузла моделі за вказаними розмірами x, y та z

source: Shift the volume by the given values
uk: Зсув об'єму на задані значення

source: Center the current active nodes at the reference position
uk: Центрувати поточні активні вузли на позиції посилання

source: Center the current active nodes at the origin
uk: Центрувати поточні активні вузли в початковій точці

source: Move the voxels inside the volume by the given values without changing the volume bounds
uk: Перемістити вокселі всередині об'єму на задані значення, не змінюючи межі об'єму

source: Copy selection
uk: Копіювати вибір

source: Paste clipboard to current selection or reference position
uk: Вставити буфер обміну в поточний вибір або позицію посилання

source: Paste clipboard to current cursor position
uk: Вставити буфер обміну в поточну позицію курсора

source: Paste clipboard as a new node
uk: Вставити буфер обміну як новий вузол

source: Cut selection
uk: Вирізати вибір

source: Undo your last step
uk: Скасувати останній крок

source: Redo your last step
uk: Повторити останній крок

source: Rotate active nodes around the given axis
uk: Повернути активні вузли навколо заданої осі

source: Merge two given nodes or active model node with the next one
uk: Об'єднати два задані вузли або активний вузол моделі з наступним

source: Merge all nodes
uk: Об'єднати всі вузли

source: Merge all visible nodes
uk: Об'єднати всі видимі вузли

source: Merge all locked nodes
uk: Об'єднати всі заблоковані вузли

source: Animate all nodes with the given delay in millis between the frames
uk: Анімувати всі вузли з заданою затримкою в мілісекундах між кадрами

source: Use the given index to select the color from the current palette
uk: Використовуйте заданий індекс для вибору кольору з поточної палітри

source: Set the current selected color by finding the closest rgb match in the palette
uk: Встановити поточний вибраний колір, знаходячи найближче відповідність RGB в палітрі

source: Pick the current selected color from current cursor voxel
uk: Вибрати поточний вибраний колір з поточного вокселя курсора

source: Flip the selected nodes around the given axis
uk: Перевернути вибрані вузли навколо заданої осі

source: Add a new model node (with a given name and width, height, depth - all optional)
uk: Додати новий вузол моделі (з заданим ім'ям та шириною, висотою, глибиною - все необов'язково)

source: Delete a particular node by id - or the current active one
uk: Видалити певний вузол за ідентифікатором - або поточний активний

source: Lock a particular node by id - or the current active one
uk: Заблокувати певний вузол за ідентифікатором - або поточний активний

source: Toggle the lock state of a particular node by id - or the current active one
uk: Перемикання стану блокування певного вузла за ідентифікатором - або поточного активного

source: Unlock a particular node by id - or the current active one
uk: Розблокувати певний вузол за ідентифікатором - або поточний активний

source: Set or print the current active node
uk: Встановити або надрукувати поточний активний вузол

source: Toggle the visible state of a node
uk: Перемикнути видимий стан вузла

source: Show all nodes
uk: Показати всі вузли

source: Hide all nodes
uk: Сховати всі вузли

source: Show all children nodes
uk: Показати всі дочірні вузли

source: Hide all children nodes
uk: Сховати всі дочірні вузли

source: Hide all model nodes except the active one
uk: Сховати всі вузли моделі, крім активного

source: Lock all nodes
uk: Заблокувати всі вузли

source: Unlock all nodes
uk: Розблокувати всі вузли

source: Rename the current node or the given node id
uk: Перейменувати поточний вузол або заданий ідентифікатор вузла

source: Duplicates the current node or the given node id
uk: Дублює поточний вузол або заданий ідентифікатор вузла

source: Create a node reference for the given node id
uk: Створити посилання на вузол за заданим ідентифікатором вузла

source: Unreference from model and allow to edit the voxels for this node
uk: Видалити посилання з моделі та дозволити редагування вокселів для цього вузла

source: Change the modifier type to 'select'
uk: Змінити тип модифікатора на 'вибір'

source: Change the modifier type to 'color picker'
uk: Змінити тип модифікатора на 'вибір кольору'

source: Change the modifier type to 'erase'
uk: Змінити тип модифікатора на 'видалення'

source: Change the modifier type to 'place'
uk: Змінити тип модифікатора на 'розміщення'

source: Change the modifier type to 'override'
uk: Змінити тип модифікатора на 'перезапис'

source: Change the brush type to '%s'
uk: Змінити тип пензля на '%s'

source: Change the brush type to 'none'
uk: Змінити тип пензля на 'немає'

source: Toggle locked mode for the given axis at the current cursor position
uk: Перемикнути заблокований режим для заданої осі в поточній позиції курсора

source: Toggle locked mode for the x axis at the current cursor position
uk: Перемикнути заблокований режим для осі x в поточній позиції курсора

source: Toggle locked mode for the y axis at the current cursor position
uk: Перемикнути заблокований режим для осі y в поточній позиції курсора

source: Toggle locked mode for the z axis at the current cursor position
uk: Перемикнути заблокований режим для осі z в поточній позиції курсора

source: Set center plane building
uk: Встановити побудову площини центру
