Repository: BenMcLean/vengi
Catalog: data/shared/*.po
Languages: uk

source: Set default aabb voxel building mode
uk: Встановити режим побудови вокселів за замовчуванням

source: Set single voxel building mode - continue setting voxels until you release the action button
uk: Встановити режим побудови одного вокселя - продовжуйте встановлювати вокселі, поки не відпустите кнопку дії

source: Mirror along the x axis at the reference position
uk: Відобразити вздовж осі x в позиції посилання

source: Mirror along the y axis at the reference position
uk: Відобразити вздовж осі y в позиції посилання

source: Mirror along the z axis at the reference position
uk: Відобразити вздовж осі z в позиції посилання

source: Disable mirror axis
uk: Вимкнути ось дзеркала

source: Change the modifier shape type
uk: Змінити тип форми модифікатора

source: Toggle center at cursor
uk: Перемикнути центр на курсор

source: Toggle continuously placing the stamp voxels
uk: Перемикнути безперервне розміщення вокселів штампу

source: Rotate stamp volume around the given axis
uk: Повернути об'єм штампу навколо заданої осі

source: Use the current selection as new stamp
uk: Використовувати поточний вибір як новий штамп

source: Use the current selected node volume as new stamp
uk: Використовувати поточний об'єм вибраного вузла як новий штамп

source: Paste the current clipboard content as stamp
uk: Вставити поточний вміст буфера обміну як штамп

source: Change the text brush axis
uk: Змінити ось текстового пензля
